In [5]:
import pandas as pd
from sqlalchemy import create_engine

In [6]:
conn_string = 'sqlite:///painting.db'
db = create_engine(conn_string)
conn = db.connect()

In [7]:
files = ['artist', 'canvas_size', 'image_link', 'museum_hours', 'museum', 'product_size', 'subject', 'work']

In [14]:
for file in files:
    df = pd.read_csv(f'{file}.csv')
    df.to_sql(file, con = conn, if_exists = 'replace', index = False)

In [27]:
query = "PRAGMA table_info(artist)"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   cid          name    type  notnull dflt_value  pk
0    0     artist_id  BIGINT        0       None   0
1    1     full_name    TEXT        0       None   0
2    2    first_name    TEXT        0       None   0
3    3  middle_names    TEXT        0       None   0
4    4     last_name    TEXT        0       None   0
5    5   nationality    TEXT        0       None   0
6    6         style    TEXT        0       None   0
7    7         birth  BIGINT        0       None   0
8    8         death  BIGINT        0       None   0

In [30]:
query = "PRAGMA table_info(canvas_size)"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   cid     name    type  notnull dflt_value  pk
0    0  size_id  BIGINT        0       None   0
1    1    width  BIGINT        0       None   0
2    2   height   FLOAT        0       None   0
3    3    label    TEXT        0       None   0

In [29]:
query = "PRAGMA table_info(image_link)"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   cid                 name    type  notnull dflt_value  pk
0    0              work_id  BIGINT        0       None   0
1    1                  url    TEXT        0       None   0
2    2  thumbnail_small_url    TEXT        0       None   0
3    3  thumbnail_large_url    TEXT        0       None   0

In [31]:
query = "PRAGMA table_info(museum_hours)"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   cid       name    type  notnull dflt_value  pk
0    0  museum_id  BIGINT        0       None   0
1    1        day    TEXT        0       None   0
2    2       open    TEXT        0       None   0
3    3      close    TEXT        0       None   0

In [32]:
query = "PRAGMA table_info(museum)"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   cid       name    type  notnull dflt_value  pk
0    0  museum_id  BIGINT        0       None   0
1    1       name    TEXT        0       None   0
2    2    address    TEXT        0       None   0
3    3       city    TEXT        0       None   0
4    4      state    TEXT        0       None   0
5    5     postal    TEXT        0       None   0
6    6    country    TEXT        0       None   0
7    7      phone    TEXT        0       None   0
8    8        url    TEXT        0       None   0

In [33]:
query = "PRAGMA table_info(product_size)"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   cid           name    type  notnull dflt_value  pk
0    0        work_id  BIGINT        0       None   0
1    1        size_id    TEXT        0       None   0
2    2     sale_price  BIGINT        0       None   0
3    3  regular_price  BIGINT        0       None   0

In [35]:
query = "PRAGMA table_info(subject)"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   cid     name    type  notnull dflt_value  pk
0    0  work_id  BIGINT        0       None   0
1    1  subject    TEXT        0       None   0

In [36]:
query = "PRAGMA table_info(work)"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   cid       name    type  notnull dflt_value  pk
0    0    work_id  BIGINT        0       None   0
1    1       name    TEXT        0       None   0
2    2  artist_id  BIGINT        0       None   0
3    3      style    TEXT        0       None   0
4    4  museum_id   FLOAT        0       None   0

In [37]:
# 1) Fetch all the paintings which are not displayed on any museums?
query = "SELECT * FROM work WHERE museum_id is NULL"
result_df = pd.read_sql_query(query, conn)
print(result_df)

       work_id                                          name  artist_id  \
0       125752                     Arabian Horses at Pasture        757
1       125818              Count Halm on His Basedow Estate        757
2       125763  Napoleon Before the Burning City of Smolensk        757
3       125774                 Peasants Resting in the Field        757
4       125785       Portrait Oberleutnant Theodor Von Klein        757
...        ...                                           ...        ...
10218     8273                         Waiting for an Answer        794
10219     8283                      West Point, Prout's Neck        794
10220     8285                                  Winding Line        794
10221   184820                                      Untitled        620
10222   184829                                      Untitled        620

              style museum_id
0           Baroque      None
1           Baroque      None
2           Baroque      None
3           Baroque      None
4           Baroque      None
...             ...       ...
10218  American Art      None
10219  American Art      None
10220  American Art      None
10221    Surrealism      None
10222    Surrealism      None

[10223 rows x 5 columns]

In [46]:
# 2) Are there museuems without any paintings?
query2 = "SELECT * FROM museum m WHERE NOT EXISTS (SELECT 1 FROM work w WHERE w.museum_id = m.museum_id)"
result_df2 = pd.read_sql_query(query2, conn)
print(result_df2)

Empty DataFrame
Columns: [museum_id, name, address, city, state, postal, country, phone, url]
Index: []

In [45]:
# 3) How many paintings have an asking price of more than their regular price? 
query3 = "select * from product_size where sale_price > regular_price"
result_df3 = pd.read_sql_query(query3, conn)
print(result_df3)

Empty DataFrame
Columns: [work_id, size_id, sale_price, regular_price]
Index: []

In [47]:
# 4) Identify the paintings whose asking price is less than 50% of its regular price
query4 = "select *  from product_size where sale_price < (regular_price*0.5)"	
result_df4 = pd.read_sql_query(query4, conn)
print(result_df4)

    work_id  size_id  sale_price  regular_price
0     31780       36          10            125
1     31780       30          10             95
2     31780       36          10            125
3     31780       30          10             95
4    198417       36          30            125
5    198417       30          30             95
6     31974       24          30             85
7     17351       24          10             85
8     17351       30          10             95
9     17351       36          10            125
10    30947     3024         285            575
11    30947     3226         305            645
12    23710       30          20             95
13    23710       24          20             85
14    20084     6040         585           1245
15   133971  #VALUE!        1025           2235
16    28259       30          40             95
17    28259       24          40             85
18    28261       24          40             85
19    28261       30          40             95
20    28273       24          40             85
21    28273       30          40             95
22    28279       48          60            165
23    28279       40          60            145
24    28279       36          60            125
25    28287       30          40             95
26    28287       36          40            125
27    28295       20          30             75
28    28295       24          30             85
29    28295       30          30             95
30    28297       36          50            125
31   169367       36          50            125
32   190824     6040         635           1275
33     4455     4848         505           1015
34   190960     2936         335            695
35   190940     3629         335            695
36   190950     3629         335            695
37      404   2823.2         265            545
38     2858     2420         245            515
39     2862     3226         305            615
40     7335     2632         305            615
41     7335     3040         385            775
42     7339     3226         305            615
43     7339     4030         385            775
44     6504       36          30            125
45     6504       30          30             95
46     6504       24          30             85
47     6546       24          30             85
48     6546       30          30             95
49     6546       36          30            125
50     6558       24          30             85
51     6558       30          30             95
52   133520  #VALUE!         965           2015
53     4703     4848         505           1015
54      961     4060         615           1255
55     8191     3624         315            635
56     8225     2632         305            625
57     8225     3040         385            775

In [49]:
query = '''select full_name as artist_name, nationality, no_of_paintings
	from (
		select a.full_name, a.nationality
		,count(1) as no_of_paintings
		,rank() over(order by count(1) desc) as rnk
		from work w
		join artist a on a.artist_id=w.artist_id
		join subject s on s.work_id=w.work_id
		join museum m on m.museum_id=w.museum_id
		where s.subject='Portraits'
		and m.country != 'USA'
		group by a.full_name, a.nationality) x
	where rnk=1 '''
result_df = pd.read_sql_query(query, conn)
print(result_df)

           artist_name nationality  no_of_paintings
0  Jan Willem Pieneman       Dutch               14
1     Vincent Van Gogh       Dutch               14

In [52]:
#Q: NUMBER OF ARTISTS OF EACH NATIONALITY
query = "SELECT nationality, COUNT(artist_id) FROM artist GROUP BY nationality ORDER BY COUNT(artist_id)"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   nationality  COUNT(artist_id)
0      Mexican                 1
1       Danish                 2
2        Irish                 2
3     Japanese                 2
4    Norwegian                 2
5     Canadian                 3
6      Belgian                 4
7     Austrian                 6
8      Flemish                 8
9      Spanish                10
10       Swiss                11
11     Russian                14
12      German                20
13     Italian                26
14     English                44
15       Dutch                68
16    American                83
17      French               115

In [53]:
#Q: DISPLAY ALL THE UNIQUE FIRST NAMES OF ARTISTS
query = "SELECT DISTINCT first_name FROM artist"
result_df = pd.read_sql_query(query, conn)
print(result_df)

     first_name
0        Pierre
1     Alexandre
2         James
3    Maximilien
4        August
..          ...
214         Max
215        Carl
216      Daniel
217   Rembrandt
218      Edmund

[219 rows x 1 columns]

In [54]:
#Q: NUMBER OF ARTISTS OF EACH STYLE
query = "SELECT style, COUNT(artist_id) FROM artist GROUP BY style ORDER BY COUNT(artist_id)"
result_df = pd.read_sql_query(query, conn)
print(result_df)

                   style  COUNT(artist_id)
0           America West                 1
1      Early Renaissance                 2
2                Ukiyo-e                 2
3          American West                 3
4                   Folk                 3
5              Mannerist                 3
6             Surrealist                 3
7             Modern Art                 4
8            Art Nouveau                 5
9            Avant-Garde                 5
10               Fauvist                 5
11              Futurist                 5
12      High Renaissance                 5
13         Landscape Art                 6
14            Naturalist                 6
15  Northern Renaissance                 6
16           Pointillist                 6
17                  Nabi                 7
18                Cubist                 8
19           Orientalist                 9
20           Renaissance                 9
21              Colonial                11
22             Symbolist                12
23            Classicist                14
24   Hudson River School                14
25    Post-Impressionist                16
26          Neoclassical                17
27              Romantic                17
28           Portraitist                18
29            Marine Art                20
30                Rococo                23
31         Expressionist                25
32               Realist                35
33         Impressionist                42
34               Baroque                54

In [57]:
#Q: DISPLAY THE MUSEUM ID OF MUSEUMS WHICH ARE OPEN ON SUNDAY after 10AM
query = "SELECT museum_id FROM museum_hours WHERE day = 'Sunday' AND open <= '10:00:AM'"
result_df = pd.read_sql_query(query, conn)
print(result_df)

    museum_id
0          32
1          33
2          35
3          36
4          37
5          39
6          40
7          41
8          42
9          43
10         44
11         45
12         46
13         47
14         48
15         49
16         50
17         52
18         53
19         55
20         56
21         57
22         60
23         62
24         64
25         65
26         67
27         69
28         70
29         71
30         72
31         73
32         74
33         75
34         76
35         78
36         79
37         81
38         82
39         84
40         86

In [59]:
#Q: NAME OF ALL MUSEUMS PRESENT IN NEW YORK 
query = "SELECT name FROM museum WHERE city = 'New York'"
result_df = pd.read_sql_query(query, conn)
print(result_df)

                             name
0        The Museum of Modern Art
1  The Metropolitan Museum of Art
2    Solomon R. Guggenheim Museum

In [60]:
#Q: LIST ALL THE MUSEUMS WHOSE NAME CONTAINS 'GALLERY'
query = "SELECT name FROM museum WHERE name LIKE '%gallery%'"
result_df = pd.read_sql_query(query, conn)
print(result_df)

                           name
0  National Gallery of Victoria
1       National Gallery of Art
2              National Gallery
3    Hungarian National Gallery
4              The Tate Gallery
5          Uffizi Gallery Italy
6            Walker Art Gallery
7       National Gallery Prague
8             Courtauld Gallery

In [76]:
#Q: LIST THE OPENEING AND CLOSING TIMES OF ALL THE MUSEUMS LOCATED IN NEW YORK
query = "SELECT DISTINCT m.name, m2.open, m2.close FROM museum m INNER JOIN museum_hours m2 ON m.museum_id = m2.museum_id WHERE city = 'New York'"
result_df = pd.read_sql_query(query, conn)
print(result_df)

                             name      open     close
0        The Museum of Modern Art  10:30:AM  05:30:PM
1        The Museum of Modern Art  10:30:AM  07:00:PM
2  The Metropolitan Museum of Art  10:00:AM  05:00:PM
3  The Metropolitan Museum of Art  10:00:AM  05:30:PM
4  The Metropolitan Museum of Art  10:00:AM  09:00:PM
5    Solomon R. Guggenheim Museum  11:00:AM  06:00:PM
6    Solomon R. Guggenheim Museum  11:00:AM  08:00:PM

In [69]:
#Q: DISPLAY THE NAME OF ALL PORTRAITS
query = "SELECT work.name, subject.subject FROM work INNER JOIN subject ON work.work_id = subject.work_id WHERE subject.subject = 'Portraits'"
result_df = pd.read_sql_query(query, conn)
print(result_df)

                                          name    subject
0                           Comedian Tournelle  Portraits
1                             Madame de Genlis  Portraits
2                             Monsieur Meunier  Portraits
3                         Pierre Roch Vigneron  Portraits
4     Portrait de Madame La Comtesse de Lameth  Portraits
...                                        ...        ...
1065                Portrait of a Lady in Pink  Portraits
1066                Portrait of Clara Stephens  Portraits
1067                  Portrait of Mrs. C Shawl  Portraits
1068                        Portrait of a Lady  Portraits
1069                       Portrait of Pauline  Portraits

[1070 rows x 2 columns]

In [79]:
#Q: WORK ID OF 3RD COSTLIEST PAINTING
query = "SELECT work_id FROM product_size ORDER BY sale_price DESC LIMIT 2, 1"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   work_id
0     3505